weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/Test_Serveur_WEB.c
	const char PAGE_STATUS_TITLE[] = "Statut Serveur STM32";
	const char CSS_PAGE_STATUS_SPECIFIC[] =
		"table{margin:2em auto 1em auto;border-collapse:collapse;box-shadow:0 2px 8px #e0f5d8;background:#fff;}"
		"th,td{padding:0.4em 1em;border:1px solid #e0f5d8;font-size:1em;}"
		"th{background:#ffe066;color:#3a5d23;}"
		"a.button{display:inline-block;padding:1em 2em;margin:1em 0.5em;background:#388e3c;color:#fff;text-decoration:none;border-radius:8px;font-size:1.1em;transition:background 0.2s,border 0.2s;box-shadow:0 2px 8px #e0f5d8;border:2px solid #388e3c;}"
		"a.button.green{background:#28a745;border-color:#28a745;color:#fff;";

	char html[2048];
	char *ptr = html;
	char *end_ptr = html + sizeof(html);

	char ip[32] = "N/A";
	if (esp01_get_current_ip(ip, sizeof(ip)) != ESP01_OK)
		strncpy(ip, "Erreur", sizeof(ip) - 1);

	GPIO_PinState led = HAL_GPIO_ReadPin(LED_GPIO_PORT, LED_GPIO_PIN);

	const esp01_stats_t *stats = &g_stats;

	if (esp01_check_buffer_size(strlen(ptr) + 256, end_ptr - ptr) != ESP01_OK)
		return;

	ptr += snprintf(ptr, end_ptr - ptr, "%s%s%s%s", HTML_DOC_START, HTML_TITLE_START, PAGE_STATUS_TITLE, HTML_TITLE_END_STYLE_START);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", PAGE_CSS);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", CSS_PAGE_STATUS_SPECIFIC);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", HTML_STYLE_END_HEAD_BODY_CARD_START);

	ptr += snprintf(ptr, end_ptr - ptr,
					"<h1>Serveur STM32</h1>"
					"<table>"
					"<tr><th>IP serveur</th><td>%s</td></tr>"
					"<tr><th>Port serveur</th><td>%u</td></tr>"
					"<tr><th>LED</th><td style='color:%s'>%s</td></tr>"
					"<tr><th>Connexions actives</th><td>%d</td></tr>"
					"</table>",
					ip,
					g_server_port,
					(led == GPIO_PIN_SET) ? "#28a745" : "#dc3545",
					(led == GPIO_PIN_SET) ? "allumée" : "éteinte",
					esp01_get_active_connection_count());

	ptr += snprintf(ptr, end_ptr - ptr,
					"<h2>Connexions TCP</h2>"
					"<table><tr><th>ID</th><th>Dernière activité (ms)</th><th>IP client</th><th>Port client</th></tr>");
	int nb_affichees = 0;
	for (int i = 0; i < g_connection_count; ++i)
	{
		if (esp01_is_connection_active(i))
		{
			const connection_info_t *c = &g_connections[i];
			ptr += snprintf(ptr, end_ptr - ptr,
							"<tr><td>%d</td><td>%lu</td><td>%s</td><td>%u</td></tr>",
							c->conn_id,
							(unsigned long)(HAL_GetTick() - c->last_activity),
							c->client_ip[0] ? c->client_ip : "N/A",
							c->client_port);
			nb_affichees++;
		}
	}
	if (nb_affichees == 0)
	{
		ptr += snprintf(ptr, end_ptr - ptr, "<tr><td colspan='4'><i>Aucune connexion active</i></td></tr>");
	}
	ptr += snprintf(ptr, end_ptr - ptr, "</table>");

	ptr += snprintf(ptr, end_ptr - ptr,
					"<h2>Statistiques HTTP</h2>"
					"<table>"
					"<tr><th>Requêtes reçues</th><td>%lu</td></tr>"
					"<tr><th>Réponses envoyées</th><td>%lu</td></tr>"
					"<tr><th>Succès</th><td>%lu</td></tr>"
					"<tr><th>Échecs</th><td>%lu</td></tr>"
					"<tr><th>Temps moyen (ms)</th><td>%lu</td></tr>"
					"</table>",
					(unsigned long)stats->total_requests,
					(unsigned long)stats->response_count,
					(unsigned long)stats->successful_responses,
					(unsigned long)stats->failed_responses,
					(unsigned long)stats->avg_response_time_ms);

	ptr += snprintf(ptr, end_ptr - ptr, "<a class='button green' href='/'>Accueil</a>");
	ptr += snprintf(ptr, end_ptr - ptr, "%s", HTML_CARD_END_BODY_END);

	printf("[TEST][INFO] Sortie de page_status, réponse envoyée sur conn_id=%d, taille=%d\r\n", conn_id, (int)strlen(html));
	esp01_send_http_response(conn_id, 200, "text/html; charset=UTF-8", html, strlen(html));
}

// Structure pour les informations système
typedef struct
{
	char at_version[64];
	char stm32_type[32];
	char wifi_mode[8];
	const char *wifi_ssid;
	uint16_t server_port;
	const char *multi_conn;
} system_info_t;

// Fonction pour collecter les informations système
static void collect_system_info(system_info_t *info)
{
	if (!info)
		return;

	// Firmware ESP01
	strcpy(info->at_version, "N/A");
	char resp[256] = {0};
	if (esp01_get_at_version(resp, sizeof(resp)) == ESP01_OK)
	{
		// Utilise la fonction de parsing pour extraire la ligne "AT version:"
		char *line = strstr(resp, "AT version:");
		if (line)
		{
			char *end = strchr(line, '\n');
			size_t len = end ? (size_t)(end - line) : strlen(line);
			if (len > 0 && len < sizeof(info->at_version))
			{
				strncpy(info->at_version, line, len);
				info->at_version[len] = '\0';
			}
		}
	}

	// Type de carte STM32
	strcpy(info->stm32_type, "STM32 inconnue");
#if defined(STM32L4)
	strcpy(info->stm32_type, "STM32L4");
#elif defined(STM32F4)
	strcpy(info->stm32_type, "STM32F4");
#elif defined(STM32L1)
	strcpy(info->stm32_type, "STM32L1");
#elif defined(STM32F1)
	strcpy(info->stm32_type, "STM32F1");
#elif defined(STM32F7)
	strcpy(info->stm32_type, "STM32F7");
#elif defined(STM32H7)
	strcpy(info->stm32_type, "STM32H7");
#endif

	// Config WiFi - Utiliser directement la valeur de ESP01_WIFI_MODE_STA
	if (ESP01_WIFI_MODE_STA == 1)
	{
		strcpy(info->wifi_mode, "STA");
	}
	else
	{
		strcpy(info->wifi_mode, "AP");
	}

	info->wifi_ssid = SSID;

	// Config serveur
	info->server_port = g_server_port;
	info->multi_conn = (ESP01_MULTI_CONNECTION) ? "Oui" : "Non";
}

// Fonction pour rendre une section HTML avec table
static int render_html_section(char *buffer, size_t buffer_size, const char *title,
							   const char **labels, const char **values, int row_count)
{
	char *ptr = buffer;
	char *end_ptr = buffer + buffer_size;
	int written = 0;

	// Titre de la section
	written = snprintf(ptr, end_ptr - ptr, "<h%d>%s</h%d><table>",
					   (title[0] == 'I') ? 1 : 2, title, (title[0] == 'I') ? 1 : 2);
	ptr += written;

	// Lignes de la table
	for (int i = 0; i < row_count; i++)
	{
		int row_len = snprintf(ptr, end_ptr - ptr,
							   "<tr><th>%s</th><td>%s</td></tr>",
							   labels[i], values[i]);
		ptr += row_len;
		written += row_len;
	}

	// Fermeture de la table
	int end_len = snprintf(ptr, end_ptr - ptr, "</table>");
	written += end_len;

	return written;
}

