weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/Test_Serveur_WEB.c
// --- Page Infos Système & Réseau ("/device") ---
static void page_device(int conn_id, const http_parsed_request_t *req)
{
	if (!req)
		return;
	printf("[TEST][INFO] Entrée dans page_device (conn_id=%d)\r\n", conn_id);

	const char PAGE_DEVICE_TITLE[] = "Infos Système & Réseau";
	const char CSS_PAGE_DEVICE_SPECIFIC[] =
		"table{margin:2em auto 1em auto;border-collapse:collapse;box-shadow:0 2px 8px #e0f5d8;background:#fff;}"
		"th,td{padding:0.4em 1em;border:1px solid #e0f5d8;font-size:1em;}"
		"th{background:#ffe066;color:#3a5d23;}"
		"a.button{display:inline-block;padding:1em 2em;margin:1em 0.5em;background:#388e3c;color:#fff;text-decoration:none;border-radius:8px;font-size:1.1em;transition:background 0.2s,border 0.2s;box-shadow:0 2px 8px #e0f5d8;border:2px solid #388e3c;}"
		"a.button.green{background:#28a745;border-color:#28a745;color:#fff;";

	system_info_t sys_info;
	collect_system_info(&sys_info);

	char html[2048];
	html[0] = '\0';
	char *ptr = html;
	char *end_ptr = html + sizeof(html);

	if (esp01_check_buffer_size(strlen(ptr) + 256, end_ptr - ptr) != ESP01_OK)
		return;

	ptr += snprintf(ptr, end_ptr - ptr, "%s%s%s%s",
					HTML_DOC_START, HTML_TITLE_START,
					PAGE_DEVICE_TITLE, HTML_TITLE_END_STYLE_START);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", PAGE_CSS);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", CSS_PAGE_DEVICE_SPECIFIC);
	ptr += snprintf(ptr, end_ptr - ptr, "%s", HTML_STYLE_END_HEAD_BODY_CARD_START);

	const char *sys_labels[] = {"Firmware ESP01", "Carte STM32"};
	const char *sys_values[] = {sys_info.at_version, sys_info.stm32_type};
	ptr += render_html_section(ptr, end_ptr - ptr, "Informations Système",
							   sys_labels, sys_values, 2);

	const char *wifi_labels[] = {"Mode", "SSID"};
	const char *wifi_values[] = {sys_info.wifi_mode, sys_info.wifi_ssid};
	ptr += render_html_section(ptr, end_ptr - ptr, "Configuration WiFi",
							   wifi_labels, wifi_values, 2);

	char port_str[8];
	snprintf(port_str, sizeof(port_str), "%u", sys_info.server_port);

	const char *server_labels[] = {"Port", "Multi-connexion"};
	const char *server_values[] = {port_str, sys_info.multi_conn};
	ptr += render_html_section(ptr, end_ptr - ptr, "Configuration Serveur",
							   server_labels, server_values, 2);

	ptr += snprintf(ptr, end_ptr - ptr, "<a class='button green' href='/'>Accueil</a>");
	ptr += snprintf(ptr, end_ptr - ptr, "%s", HTML_CARD_END_BODY_END);

	printf("[TEST][INFO] Sortie de page_device, réponse envoyée sur conn_id=%d, taille=%d\r\n", conn_id, (int)strlen(html));
	esp01_send_http_response(conn_id, 200, "text/html; charset=UTF-8", html, strlen(html));
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_USART2_UART_Init();
	MX_USART1_UART_Init();
	/* USER CODE BEGIN 2 */
	HAL_Delay(1000);
	printf("\n[TEST][INFO] === Démarrage du programme de test du module STM32_WifiESP_HTTP ===\r\n");
	HAL_Delay(500);

	ESP01_Status_t status;

	// 1. Initialisation du driver ESP01
	printf("\n[TEST][INFO] === Initialisation du driver ESP01 ===\r\n");
	status = esp01_init(&huart1, &huart2, esp01_dma_rx_buf, ESP01_DMA_RX_BUF_SIZE);
	printf("[TEST][INFO] Initialisation du driver ESP01 : %s\r\n", esp01_get_error_string(status));
	HAL_Delay(500);

	// 2. Flush du buffer RX
	printf("\n[TEST][INFO] === Vidage du buffer RX ===\r\n");
	status = esp01_flush_rx_buffer(500);
	printf("[TEST][INFO] Buffer UART/DMA vidé : %s\r\n", esp01_get_error_string(status));
	HAL_Delay(500);

	// 3. test de communication AT
	printf("\n[TEST][INFO] === Test de communication AT ===\r\n");
	status = esp01_test_at();
	printf("[TEST][INFO] Test AT : %s\r\n", esp01_get_error_string(status));
	HAL_Delay(500);

	// 4. Test de version AT+GMR
	printf("\n[TEST][INFO] === Lecture version firmware ESP01 (AT+GMR) ===\r\n");
	char at_version[256] = {0};
	status = esp01_get_at_version(at_version, sizeof(at_version));
	printf("[TEST][INFO] Version ESP01 : %s\r\n", at_version);
	HAL_Delay(500);

	// 5. Connexion au réseau WiFi
	printf("\n[TEST][INFO] === Connexion au réseau WiFi ===\r\n");
	status = esp01_connect_wifi_config(
		ESP01_WIFI_MODE_STA, // mode
		SSID,				 // ssid
		PASSWORD,			 // password
		true,				 // use_dhcp
		NULL,				 // ip
		NULL,				 // gateway
		NULL				 // netmask
	);
	printf("[TEST][INFO] Connexion WiFi : %s\r\n", esp01_get_error_string(status));
	HAL_Delay(500);

	// 6. Activation du mode multi-connexion ET démarrage du serveur web
	printf("\n[TEST][INFO] === Activation multi-connexion + démarrage serveur web ===\r\n");
	ESP01_Status_t server_status = esp01_start_server_config(
		true, // multi-connexion
		80,	  // port
		true  // ipdinfo (affichage IP client dans +IPD)
	);
	if (server_status != ESP01_OK)
	{
		printf("[TEST][ERROR] CIPMUX/CIPSERVER : %s\r\n", esp01_get_error_string(server_status));
		Error_Handler();
	}
	else
	{
		printf("[TEST][INFO] Serveur web démarré sur le port 80\r\n");
	}
	HAL_Delay(500);

	// 7. Ajout des routes HTTP
	printf("\n[TEST][INFO] === Ajout des routes HTTP ===\r\n");
	esp01_clear_routes();
	printf("[TEST][INFO] Ajout route /\r\n");
	esp01_add_route("/", page_root);
	printf("[TEST][INFO] Ajout route /status\r\n");
	esp01_add_route("/status", page_status);
	printf("[TEST][INFO] Ajout route /led\r\n");
	esp01_add_route("/led", page_led);
	printf("[TEST][INFO] Ajout route /testget\r\n");
	esp01_add_route("/testget", page_testget);
	printf("[TEST][INFO] Ajout route /device\r\n");
	esp01_add_route("/device", page_device);
	HAL_Delay(500);

	// 8. Vérification serveur ESP01
	printf("\n[TEST][INFO] === Vérification de l'état des connexions ===\r\n");
	esp01_print_connection_status();
	HAL_Delay(500);

	// 9. Affichage de la configuration IP complète
	printf("\n[TEST][INFO] === Configuration IP complète ===\r\n");
	char ipc[32] = "N/A", gw[32] = "N/A", mask[32] = "N/A";
	if (esp01_get_ip_config(ipc, sizeof(ipc), gw, sizeof(gw), mask, sizeof(mask)) == ESP01_OK)
	{
		printf("[TEST][INFO] IP: %s\r\n", ipc);
		printf("[TEST][INFO] Gateway: %s\r\n", gw);
		printf("[TEST][INFO] Masque: %s\r\n", mask);
	}
	else
	{
		printf("[TEST][ERROR] Impossible de récupérer la configuration IP complète\r\n");
	}
	HAL_Delay(500);

